[
  {
    "project": "Beta Launch Plan",
    "generated_title": "Team Meeting on New Portal Launch",
    "peers": [
      "Karl",
      "Jane",
      "Nala",
      "Luka",
      "Marco"
    ],
    "recordings": [
      {
        "file_path": "o/dev-seed-files/portal-launch.mp4",
        "transcription_vtt": "WEBVTT\n\n00:00:00.000 --> 00:00:03.500\nKarl: Hey everyone, thanks for joining. How's the new portal coming along? The enterprise clients are getting antsy about the legacy system.\n\n00:00:04.000 --> 00:00:09.500\nJane: Hi Karl. Uh, we've got some progress to share, but also a few blockers we should discuss.\n\n00:00:10.000 --> 00:00:15.500\nNala: Sorry, just getting my screen share ready...\n\n00:00:16.000 --> 00:00:25.000\nKarl: No worries. Look, I'll be direct here - marketing needs to start the campaign soon, and I'm hearing whispers about delays. What's our actual timeline looking like?\n\n00:00:25.500 --> 00:00:40.000\nJane: Right, so... we're still targeting GA for when Bob's thing wraps up, but we've got some snags. You know how the perf project is taking all his bandwidth... Luka's been working through the React implementation, but we're seeing some issues that need bob's team's eyes.\n\n00:00:40.500 --> 00:00:55.000\nLuka: Yeah, um, so this is making prod really slow. Like, when a client tries to raise a ticket, it's taking forever. I've been trying to get Bob's attention, but he's super focused on some othe top priority project. The thing is, when we make the GraphQL query to fetch the client's SLA matrix, it has to go through the legacy parsing system because of how we used to handle the old on-prem deployments, and then it needs to calculate the MTR scores for their region, and then... \n\n00:00:55.500 --> 00:01:10.000\nJane: Luka, let's save the technical deep-dive for the eng sync. Karl just needs to know it's slow.\n\n00:00:55.500 --> 00:01:05.000\nKarl: So what's the actual impact here? Will this affect client response times?\n\n00:01:10.500 --> 00:01:25.000\nJane: I've tried grabbing Lucy, but you know how Bob is about the perf project right now. Can't really blame him after what happened in Q2... I might need to drag Marco into this, but even then, Bob's the only one who really knows that legacy stack.\n\n00:01:25.500 --> 00:01:35.000\nNala: While we're talking about blockers... Still waiting on those smart-routing animations from Pixel Perfect. You know, the ones that show clients how their tickets flow through our NOC teams. They promised delivery last week.\n\n00:01:35.500 --> 00:01:45.000\nKarl: Can we launch without the animations? Use something basic for now?\n\n00:01:45.500 --> 00:02:00.000\nNala: Ana was pretty clear that the animations are a key differentiator. We've already paid the agency... They keep saying \"just a few more days\" but... \n\n00:02:00.500 --> 00:02:15.000\nJane: I'll chase them again today. The other thing we need to discuss is Mark's been pushing about the Kubernetes migration. He wants us to start containerizing the app now.\n\n00:02:15.500 --> 00:02:25.000\nLuka: Sorry, but can we not? We've got enough on our plate with the performance issues...\n\n00:02:25.500 --> 00:02:40.000\nKarl: Yeah, I'm not sure what any of this means but I'm with Luka here. Launch first, container... whatever... later. What's the worst that could happen?\n\n00:02:40.500 --> 00:02:55.000\nJane: It's a Mark and Shiv thing... They're pushing hard on the kubernetes migration again and this is a required step.\n\n00:02:15.500 --> 00:02:25.000\nLuka: I'd need a lot of help from one of them to get this done, and we've got enough on our plate with the API...\n\n00:02:25.500 --> 00:02:40.000\nKarl: Yeah, what's the deal with that? Is this another one of Mark's \"future-proofing\" things?\n\n00:02:40.500 --> 00:02:55.000\nJane: You know how he's been since the February outage. He's got Shiv building out this whole new platform, and now they want us to be the first team to migrate. Says if we don't do it before launch, it'll be just like the microservices situation all over again\n\n00:03:10.500 --> 00:03:25.000\nLuka: SSO integration is done for all supported IdPs, ticket creation works but it's slow... the agent allocation engine is about 80% there. The SLA calculator is what worries me most with these API issues. Oh! And I've been meaning to ask about the thing where we need to handle clients who are still using the ancient SOAP endpoints from 2018, so I was thinking we could add a proxy layer that—\n\n00:03:25.500 --> 00:03:40.000\nNala: I can show the latest designs for the ticket submission flow actually. The new smart-routing interface. Screen sharing now...\n\n\n00:03:40.500 --> 00:03:50.000\nKarl: That looks clean. But what's this loading spinner here? When our enterprise clients have a critical infrastructure failure, they can't wait 8 seconds just to see their MTR score...\n\n00:03:50.500 --> 00:04:05.000\nLuka: Uh... yeah, that's the price calculation endpoint. Bob says it's because it's hitting three different microservices and...\n\n00:04:05.500 --> 00:04:20.000\nJane: Okay, here's what we do. I'll try one more time with Bob's team - maybe we can at least get Lucy for the high-priority endpoints. Worst case, we can probably grab someone from Shiv's team who worked on the original service. Nala, any chance of a Plan B for the UI?\n\n00:04:20.500 --> 00:04:35.000\nNala: I mean... we still have all the stuff we built for the POC back in June. It's not as flashy as what Ana wants, but...\n\n00:04:35.500 --> 00:04:50.000\nKarl: And the timeline? Marketing needs to know. We've got billboards booked...\n\n00:04:50.500 --> 00:05:05.000\nJane: Let me be realistic here... Even if we get Bob's help this week, we're looking at minimum 2-week delay. Unless...\n\n00:05:05.500 --> 00:05:20.000\nLuka: We could do a phased rollout? Launch with basic features first? The product listing and cart work okay-ish...\n\n00:05:20.500 --> 00:05:35.000\nKarl: Ana mentioned something about this actually. What if we do a \"beta\" launch? Could spin it as exclusive access...\n\n00:05:35.500 --> 00:05:50.000\nNala: Oh, that could work! I could design a beta badge, make it feel premium rather than incomplete...\n\n00:05:50.500 --> 00:06:05.000\nJane: That... that could actually work. Luka, what do you think? Could we have a solid beta ready by the original launch date?\n\n00:06:05.500 --> 00:06:20.000\nLuka: Yeah, if we focus on core features and don't touch Kubernetes stuff... Sorry Mark...\n\n00:06:20.500 --> 00:06:35.000\nKarl: Let's sync with Ana about this. Jane, can you set up a call? Include Bob too - he needs to understand the urgency here.\n\n00:06:35.500 --> 00:06:50.000\nJane: Will do. Nala, can you put together a quick doc showing what features/designs would be in beta vs. full launch?\n\n00:06:50.500 --> 00:07:05.000\nNala: On it. I'll work with Ana to prioritize. Should have something by EOD.\n\n00:07:05.500 --> 00:07:20.000\nKarl: Perfect. One last thing - are we good on mobile responsiveness? The billboards have QR codes...\n\n00:07:20.500 --> 00:07:35.000\nLuka: Uh... we've been focusing on desktop first... mobile is... kind of rough right now...\n\n00:07:35.500 --> 00:07:50.000\nJane: Add that to the beta limitations. We'll prioritize desktop users first, make it clear in the messaging.\n\n00:07:50.500 --> 00:08:05.000\nKarl: Okay, not ideal but I get it. Send me the beta feature list when it's ready. Need to update the PR team.\n\n00:08:05.500 --> 00:08:20.000\nNala: Quick question - should I still chase Pixel Perfect about the animations if we're going beta route?\n\n00:08:20.500 --> 00:08:35.000\nJane: Yes, keep the pressure on. We'll want those for the full launch. Speaking of which, Karl, when would marketing want to do the full launch?\n\n00:08:35.500 --> 00:08:50.000\nKarl: Holiday season is key. Needs to be fully ready by Black Friday. No wiggle room there.\n\n00:08:50.500 --> 00:09:05.000\nLuka: That's... about 3 months to fix performance, add mobile support, and do the container thing?\n\n00:09:05.500 --> 00:09:20.000\nJane: And implement the full checkout flow, and integrate the animations... We should probably map this out properly.\n\n00:09:20.500 --> 00:09:35.000\nKarl: Do what you need to do, just make sure we hit Black Friday. Jane, send me daily updates on the beta progress?\n\n00:09:35.500 --> 00:09:50.000\nJane: Will do. Luka, you focus on the critical path items. I'll handle Mark and the Kubernetes discussions.\n\n00:09:50.500 --> 00:10:05.000\nNala: Should we schedule a design review for the beta badge and messaging today? I can do 3pm.\n\n00:10:05.500 --> 00:10:20.000\nKarl: Include someone from marketing in that. They need to approve any \"beta\" messaging.\n\n00:10:20.500 --> 00:10:35.000\nJane: Okay, action items: I'll talk to Bob's manager, set up call with Ana, and handle Mark. Nala's doing beta design doc. Luka continues with core features...\n\n00:10:35.500 --> 00:10:50.000\nKarl: Perfect. Keep me posted. Need to run to another call...\n\n00:10:50.500 --> 00:11:05.000\nJane: Thanks Karl. Nala, Luka - let's stay on for a few minutes to discuss the technical details?\n\n00:11:05.500 --> 00:11:20.000\nLuka: Yeah, I should probably explain the API issues in more detail...\n\n00:11:20.500 --> 00:11:35.000\nKarl: Thanks everyone, send me that beta doc when ready!\n",
        "size": 65335581,
        "duration": 653.0,
        "max_width": 1920,
        "max_height": 1080,
        "summary_sections": []
      }
    ]
  },
  {
    "project": "Infrastructure Improvements",
    "generated_title": "Discussion on AWS Networking Challenges for Kubernetes",
    "peers": [
      "Marco",
      "Mark"
    ],
    "recordings": [
      {
        "file_path": "o/dev-seed-files/aws-k8s-discussion.mp4",
        "transcription_vtt": "WEBVTT\n\n00:00:00.000 --> 00:00:05.000\nMarco: Hey Mark, thanks for making time to discuss the Kubernetes project. I've been running into some issues...\n\n00:00:05.500 --> 00:00:15.000\nMark: Of course, Marco. What’s the main challenge? Is it related to deployment, scaling, or something else?\n\n00:00:15.500 --> 00:00:30.000\nMarco: It’s AWS’s networking stack. We’ve got multiple VPCs, and the peering configurations are making communication between Kubernetes clusters really tricky.\n\n00:00:30.500 --> 00:00:45.000\nMark: I see. The networking setup in AWS can be painful for multi-cluster Kubernetes setups. Are you running into latency issues or connection drops?\n\n00:00:45.500 --> 00:01:00.000\nMarco: Both. The latency is inconsistent, and the connection drops whenever there’s a spike in traffic. We suspect it's the NAT gateway handling.\n\n00:01:00.500 --> 00:01:15.000\nMark: That makes sense. NAT gateways can bottleneck traffic, especially with bursty loads. Have you considered switching to a private link setup instead of peering?\n\n00:01:15.500 --> 00:01:30.000\nMarco: We thought about it, but the documentation wasn’t clear, and our current architecture doesn’t seem compatible. Could you share some tips on that?\n\n00:01:30.500 --> 00:01:45.000\nMark: Absolutely. I’ve set up private links in a similar scenario before. The key is designing the subnet structure to minimize cross-AZ traffic...\n\n00:01:45.500 --> 00:02:00.000\nMarco: That would be helpful. Also, what about handling DNS resolution across VPCs? That’s been another pain point for us.\n\n00:02:00.500 --> 00:02:15.000\nMark: You’ll need to set up Route 53 private hosted zones and use inbound and outbound resolvers strategically. Let’s go through the details.\n\n00:02:15.500 --> 00:02:30.000\nMarco: Thanks, Mark. This is starting to make sense. Could you help us with a PoC for the private link setup?\n\n00:02:30.500 --> 00:02:45.000\nMark: Definitely. I’ll send over some documentation and sample Terraform scripts. Let’s sync next week to review progress.\n\n00:02:45.500 --> 00:03:00.000\nMarco: That works. Appreciate your help with this!\n\n00:03:00.500 --> 00:03:15.000\nMark: Anytime, Marco. Let’s get this solved so you can focus on optimizing the Kubernetes deployment.\n",
        "size": 43782918,
        "duration": 450.0,
        "max_width": 1920,
        "max_height": 1080,
        "summary_sections": [
          {
            "section": "summary",
            "response": "<p>Marco and Mark discussed challenges with Kubernetes on AWS, focusing on networking issues like inconsistent latency, connection drops, and DNS resolution. Mark suggested using private links and Route 53 private hosted zones to address these problems and agreed to assist with a proof of concept (PoC).</p>"
          },
          {
            "section": "agenda",
            "response": "<p><strong>Kubernetes Networking Challenges</strong></p><ul><li>Inconsistent latency and connection drops due to NAT gateway bottlenecks.</li><li>DNS resolution issues across VPCs.</li></ul><p><strong>Proposed Solutions</strong></p><ul><li>Switching to AWS private links for inter-VPC communication.</li><li>Using Route 53 private hosted zones for DNS resolution.</li></ul>"
          },
          {
            "section": "next_steps",
            "response": "<ul><li><p>Mark to provide documentation and Terraform scripts for private link setup.</p></li><li><p>Marco to implement a proof of concept (PoC) based on Mark’s guidance.</p></li><li><p>Schedule a follow-up meeting next week to review progress.</p></li></ul>"
          }
        ]
      }
    ]
  }
]
