[
  {
    "author": "Jane",
    "project": "New Web App",
    "title": "Beta Launch Planning",
    "description_html": "<p>Hey team, as discussed in our last sync, the beta launch for the new web app is tentatively delayed by two weeks due to API performance issues. Let’s focus on addressing these blockers and preparing the core features for the beta rollout. Please check your tasks and provide updates in our next meeting.</p>",
    "comments": [
      {
        "user": "Luka",
        "body_html": "<p>Working on the ticket submission speed issue. Will update once I have a fix ready.</p>"
      },
      {
        "user": "Nala",
        "body_html": "<p>Finalizing the simplified UI for the beta version. Should be ready by EOD tomorrow.</p>"
      },
      {
        "user": "Ana",
        "body_html": "<p>Let me know if I need to escalate the API delays with Bob’s team.</p>"
      }
    ]
  },
  {
    "author": "Bob",
    "project": "API Performance Improvement",
    "title": "Progress Update on SLA Calculator",
    "description_html": "<p>The SLA calculator optimizations are on track, and I’m currently profiling the GraphQL query to identify the bottlenecks. I expect a significant improvement by the end of this sprint. Feel free to flag any other high-priority endpoints that need attention.</p>",
    "comments": [
      {
        "user": "Jane",
        "body_html": "<p>Thanks, Bob! The SLA calculator improvement will make a big difference for the beta launch.</p>"
      },
      {
        "user": "Luka",
        "body_html": "<p>Adding the ticket submission endpoint to the list. It’s currently the biggest issue for us.</p>"
      }
    ]
  },
  {
    "author": "Mark",
    "project": "Kubernetes Migration",
    "title": "Containerization Updates",
    "description_html": "<p>We’re nearing the critical phase of the Kubernetes migration project. Teams will need to start containerizing their apps soon to enable smooth deployment on Kubernetes. Please let Shiv or me know if you need guidance or resources to get started.</p>",
    "comments": [
      {
        "user": "Jane",
        "body_html": "<p>Mark, can this be deferred until after our beta launch? We’re currently stretched thin with the app release timeline.</p>"
      },
      {
        "user": "Shiv",
        "body_html": "<p>We’re here to assist whenever you’re ready. Let us know your timeline.</p>"
      }
    ]
  },
  {
    "author": "Ana",
    "project": "Marketing Campaign",
    "title": "Launch Messaging Strategy",
    "description_html": "<p>Hey team, I’m collaborating with Karl on the messaging strategy for the beta launch. We’re positioning it as an exclusive early access experience to build excitement while we refine the final product. Please share any key features or updates that you’d like highlighted in the marketing materials.</p>",
    "comments": [
      {
        "user": "Nala",
        "body_html": "<p>I’ll share the finalized UI designs tomorrow for inclusion in the campaign assets.</p>"
      },
      {
        "user": "Luka",
        "body_html": "<p>Core features like ticket submission and SLA calculator should definitely be included.</p>"
      }
    ]
  },
  {
    "author": "Luka",
    "project": "New Web App",
    "title": "React App Performance Issues",
    "description_html": "<p>The new React app is coming together, but the current bottleneck is the API response time. Specifically, the SLA matrix query is significantly slowing down the ticket creation process. Any assistance from Bob’s team to address this would be greatly appreciated.</p>",
    "comments": [
      {
        "user": "Bob",
        "body_html": "<p>I’m already looking into this. Expecting improvements by the end of the week.</p>"
      },
      {
        "user": "Jane",
        "body_html": "<p>Thanks for flagging this, Luka. I’ll coordinate with Bob to prioritize the API fix.</p>"
      }
    ]
  },
  {
    "author": "Nala",
    "project": "Design Review",
    "title": "Feedback on Smart Routing Animations",
    "description_html": "<p>Hey team, here are the initial designs for the smart-routing animations. These are intended to visually demonstrate how tickets flow through the NOC team. Please provide feedback or suggestions before we finalize them with Pixel Perfect.</p>",
    "comments": [
      {
        "user": "Ana",
        "body_html": "<p>The animations look great! Let’s make sure the loading indicators align with the overall UI theme.</p>"
      },
      {
        "user": "Luka",
        "body_html": "<p>These are impressive! I’ll ensure the app’s codebase is ready to integrate them smoothly.</p>"
      }
    ],
    "attachments": [
      {
        "file_path": "o/dev-seed-files/smart-routing-animation.mp4",
        "file_type": "video/mp4",
        "width": 1920,
        "height": 1080
      }
    ]
  },
  {
    "author": "Shiv",
    "project": "Infrastructure Improvements",
    "title": "Kubernetes Tooling Suggestions",
    "description_html": "<p>As we prepare for the Kubernetes migration, I’ve compiled a list of recommended tools and best practices to streamline the containerization process. Feel free to review and provide feedback. Happy to assist with specific configurations!</p>",
    "attachments": [
      {
        "file_path": "o/dev-seed-files/kubernetes-tooling-guide.pdf",
        "file_type": "application/pdf"
      }
    ]
  }
]
